In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
data=pd.Series([1,2,3],index=["a","b","c"])
data

a    1
b    2
c    3
dtype: int64

In [13]:
data.values

array([1, 2, 3], dtype=int64)

In [14]:
data.shape

(3,)

In [16]:
data.loc["a"],data.iloc[2]

(1, 3)

In [17]:
data.loc[["a", "c"]]

a    1
c    3
dtype: int64

In [18]:
ab={
    "usn":[1,2,3],
    "name":["abc","xyz","pqr"],
    "age":[21,20,22]
}

In [9]:
import  pandas as pd

In [10]:
data=pd.read_csv(r"C:\Users\Darshan\Downloads\sample.csv")

In [11]:
data

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        20 non-null     int64
 1   EmpID             20 non-null     int64
 2   Name              20 non-null     object
 3   Department        20 non-null     object
 4   Age               20 non-null     int64
 5   Salary            20 non-null     int64
 6   Experience        20 non-null     int64
 7   JoiningDate       20 non-null     object
 8   City              20 non-null     object
 9   PerformanceScore  20 non-null     float64
dtypes: float64(1), int64(5), object(4)
memory usage: 1.7+ KB

In [14]:
data.head()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1

In [15]:
data.sample()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2

In [16]:
data.Name

0       Ram
1     Shyam
2     Geeta
3     Anita
4     Kiran
5      John
6     Meena
7     David
8      Sara
9     Arjun
10     Ravi
11    Priya
12    Kunal
13    Sneha
14    Vijay
15     Neha
16     Amit
17    Pooja
18    Rahul
19    Divya
Name: Name, dtype: object

import pandas as pd

In [2]:
import pandas as pd
data=pd.read_csv(r"C:\Users\Darshan\Downloads\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [4]:
data.isnull().sum()

Unnamed: 0    0
Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [5]:
data.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [8]:
data.loc[ : ,"Name":"Age"]

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  35.0
3    David   NaN
4      Eve  29.0
5    Alice  25.0

In [13]:
data.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [14]:
data.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [18]:
data.rename(columns={"Name":"MD"},inplace=True)
data

   Unnamed: 0       MD   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [ ]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [23]:
data

        MD   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [26]:
data["Updated_salary2"]=data["Salary"].map(lambda x:x+10000)

In [27]:
data

        MD   Age Department   Salary  Update_salary2  Updated_salary2
0    Alice  25.0         HR  50000.0         60000.0          60000.0
1      Bob  30.0         IT  60000.0         70000.0          70000.0
2  Charlie  35.0    Finance  70000.0         80000.0          80000.0
3    David   NaN         IT  62000.0         72000.0          72000.0
4      Eve  29.0         HR      NaN             NaN              NaN
5    Alice  25.0         HR  50000.0         60000.0          60000.0

In [29]:
data[data["Age"]>25]

        MD   Age Department   Salary  Update_salary2  Updated_salary2
1      Bob  30.0         IT  60000.0         70000.0          70000.0
2  Charlie  35.0    Finance  70000.0         80000.0          80000.0
4      Eve  29.0         HR      NaN             NaN              NaN